#1
a = int(input('Введите целое число №1:'))
b = int(input('Введите целое число №2:'))
c = int(input('Введите целое число №3:'))
import math
if c == math.sqrt(a**2+b**2): # теорема Пифагора
    print('Прямоугольный треугольник существует')
else:
    print('Треугольник не существует')

#2
n = int(input('Введите целое число от 1 до 99:'))
if n == 1 or n == 21 or n == 31 or n == 41 or n == 51 or n == 61 or n == 71 or n == 81 or n == 91:
    print('Мне', n, 'год')
elif 1 < n <= 4 or 21 < n <= 24 or 31 < n <= 34 or 41 < n <= 44 or 51 < n <= 54 or 61 < n <= 64 or 71 < n <= 74 or 81 < n <= 84 or 91 < n <= 94:
    print('Мне', n, 'года')
elif 5 == n <= 20 or 25 == n <= 30 or 35 == n <= 40 or 45 == n <= 50 or 55 == n <= 60 or 65 == n <= 70 or 75 == n <= 80 or 85 == n <= 90 or 95 == n <= 99:
    print('Мне', n, 'лет')
else:
    print('Неверное число. Введите от 1 до 99')